var Script = function () {

    //morris chart

    $(function () {
      // data stolen from http://howmanyleft.co.uk/vehicle/jaguar_'e'_type
      /*var tax_data = [
		    {"时间点": "00:00", "今天用气量": 0, "昨天用气量": 0},
           //{"时间点": "00:30", "今天用气量": 20, "昨天用气量": 10},
           {"时间点": "01:00", "今天用气量": 38, "昨天用气量": 11},
           //{"时间点": "01:30", "今天用气量": 45, "昨天用气量": 32},
           {"时间点": "02:00", "今天用气量": 50, "昨天用气量": 21},
           //{"时间点": "02:30", "今天用气量": 52, "昨天用气量": 53},
           {"时间点": "03:00", "今天用气量": 60, "昨天用气量": 30},
           //{"时间点": "03:30", "今天用气量": 62, "昨天用气量": 61},
           {"时间点": "04:00", "今天用气量": 68, "昨天用气量": 49},
           //{"时间点": "04:30", "今天用气量": 73, "昨天用气量": 74},
		   {"时间点": "05:00", "今天用气量": 88, "昨天用气量": 57},
		   //{"时间点": "05:30", "今天用气量": 98, "昨天用气量": 97},
           {"时间点": "06:00", "今天用气量": 109, "昨天用气量": 69},
           //{"时间点": "06:30", "今天用气量": 150, "昨天用气量": 148},
           {"时间点": "07:00", "今天用气量": 186, "昨天用气量": 70},
           //{"时间点": "07:30", "今天用气量": 250, "昨天用气量": 250},
           {"时间点": "08:00", "今天用气量": 354, "昨天用气量": 83},
           //{"时间点": "08:30", "今天用气量": 400, "昨天用气量": 398},
           {"时间点": "09:00", "今天用气量": 465, "昨天用气量": 93},
           //{"时间点": "09:30", "今天用气量": 528, "昨天用气量": 519},
		   {"时间点": "10:00", "今天用气量": 557, "昨天用气量": 104},
		   //{"时间点": "10:30", "今天用气量": 640, "昨天用气量": 645},
           {"时间点": "11:00", "今天用气量": 660, "昨天用气量": 117},
           //{"时间点": "11:30", "今天用气量": 700, "昨天用气量": 681},
           {"时间点": "12:00", "今天用气量": 726, "昨天用气量": 120},
           //{"时间点": "12:30", "今天用气量": 823, "昨天用气量": 819},
           {"时间点": "13:00", "今天用气量": 900, "昨天用气量": 136},
           //{"时间点": "13:30", "今天用气量": 920, "昨天用气量": 907},
           {"时间点": "14:00", "今天用气量": 973, "昨天用气量": 148},
           //{"时间点": "14:30", "今天用气量": 1000, "昨天用气量": 989},
		   {"时间点": "15:00", "今天用气量": 1035, "昨天用气量": 152},
		   //{"时间点": "15:30", "今天用气量": 1075, "昨天用气量": 1050},
           {"时间点": "16:00", "今天用气量": 1099, "昨天用气量": 162},
           //{"时间点": "16:30", "今天用气量": 1120, "昨天用气量": 1110},
           {"时间点": "17:00", "今天用气量": 1196, "昨天用气量": 173},
           //{"时间点": "17:30", "今天用气量": 1220, "昨天用气量": 1213},
           {"时间点": "18:00", "今天用气量": 1285, "昨天用气量": 180},
           //{"时间点": "18:30", "今天用气量": 1300, "昨天用气量": 1295},
           {"时间点": "19:00", "今天用气量": 1359, "昨天用气量": 197},
           //{"时间点": "19:30", "今天用气量": 1390, "昨天用气量": 1386},
		   {"时间点": "20:00", "今天用气量": 1423, "昨天用气量": 203},
		   //{"时间点": "20:30", "今天用气量": 1507, "昨天用气量": 1494},
		   {"时间点": "21:00", "今天用气量": 1560, "昨天用气量": 210},
		   //{"时间点": "21:30", "今天用气量": 1607, "昨天用气量": 1598},
		   {"时间点": "22:00", "今天用气量": 1632, "昨天用气量": 220},
		   //{"时间点": "22:30", "今天用气量": 1701, "昨天用气量": 1670},
		   {"时间点": "23:00", "今天用气量": 1779, "昨天用气量": 235}
		   //{"时间点": "23:30", "今天用气量": 1793, "昨天用气量": 1760}
      ];
      Morris.Line({
        element: 'hero-graph',
        data: tax_data,
        xkey: '时间点',
        ykeys: ['今天用气量', '昨天用气量'],
        labels: ['今天累计用气量', '昨天累计用气量'],
        lineColors:['#8075c4','#6883a3']
      });*/

     
      
	  Morris.Bar({
        element: 'hero-bar',
        data: [
          {'上游单位': '中石化', '昨日申报量': 3000,'昨日批复量':4800,'昨日实际使用量':2750},
          {'上游单位': '中石油', '昨日申报量': 5000,'昨日批复量':2800,'昨日实际使用量':4780},
          {'上游单位': '中海油', '昨日申报量': 4000,'昨日批复量':1100,'昨日实际使用量':1900}          
        ],
        xkey:'上游单位',
        ykeys: ['昨日申报量','昨日批复量','昨日实际使用量'],
        labels: ['昨日申报量','昨日批复量','昨日实际使用量'],
        barRatio: 0.4,
        xLabelAngle: 35,
        hideHover: 'auto',
        barColors: ['#6883a3','#49e2d7','#FFD700']
		});
	  
		
	   Morris.Bar({
        element: 'hero-bar1',
        data: [
          {'下游单位': '大用户1', '昨日申报量': 300,'昨日批复量':180,'昨日实际使用量':580},
          {'下游单位': '大用户2', '昨日申报量': 285,'昨日批复量':600,'昨日实际使用量':290},
          {'下游单位': '大用户3', '昨日申报量': 582,'昨日批复量':590,'昨日实际使用量':285}, 
		  {'下游单位': '大用户4', '昨日申报量': 272,'昨日批复量':480,'昨日实际使用量':285},    
		  {'下游单位': '大用户5', '昨日申报量': 280,'昨日批复量':590,'昨日实际使用量':285},    
		  {'下游单位': '大用户6', '昨日申报量': 575,'昨日批复量':255,'昨日实际使用量':285},    
		  {'下游单位': '大用户7', '昨日申报量': 262,'昨日批复量':365,'昨日实际使用量':165},    
		  {'下游单位': '大用户8', '昨日申报量': 460,'昨日批复量':165,'昨日实际使用量':270},    
		  {'下游单位': '大用户9', '昨日申报量': 661,'昨日批复量':265,'昨日实际使用量':365},    
		  {'下游单位': '大用户10', '昨日申报量': 252,'昨日批复量':450,'昨日实际使用量':555}   
        ],
        xkey:'下游单位',
        ykeys: ['昨日申报量','昨日批复量','昨日实际使用量'],
        labels: ['昨日申报量','昨日批复量','昨日实际使用量'],
        barRatio: 0.4,
        xLabelAngle: 35,
        hideHover: 'auto',
        barColors: ['#6883a3','#49e2d7','#FFD700']
		
		});	 
	   
	  
	    $('.code-example').each(function (index, el) {
        eval($(el).text());
      });
    });
	
}();